{
    "customers": [
        {
            "sprite": "Margaret",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "<size=75%><i>*sigh* If only my life wasn't so busy… Maybe I could convince him…</i><size=100%><br>Oh! Sorry, good evening, dear bartender. I was a bit lost in my thoughts.",
                    "Would you be so kind as to get me a sweet drink, like a <b>Spring Bee</b>? Maybe that will distract me from my career…I'm an <b>actress</b>, you see."
                ],
                "leaveCorrect": [
                    "Oh, how wonderful, dear bartender. I think I even tasted a little bit of romance in this drink.<br>I shall get back to work now, but thank you truly! Goodnight!"
                ],
                "leaveWrong": [
                    "Oh… That wasn't what I expected. Maybe it was fate that didn't want to give me this tiny satisfaction.<br>It's alright, I'll come back another day… Goodnight, bartender!"  
                ],
                "leaveWater": [
                    "Thank you, dear bartender. I thought I'd tasted a hint of love in this drink, but it was very faint…<br>I shall get back to work now, goodbye!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Helene",
            "order": "Magazine",
            "lines": {
                "greet": [
                    "Good evening bartender. It seems we've chosen a distinguished bar tonight, <b>Charles</b>. An impeccable first impression, though the <b>window outside</b> could be improved somehow.",
                    "<i>Ugh</i>, how exhausting it is to not know which opera to attend tonight…",
                    "I'd like to order a <b>Magazine</b> now, please."
                ],
                "leaveCorrect": [
                    "Lovely cocktail, I'm sure you must've used a… a titanium mixing spoon, and you probably mixed ripe and unripe shaddocks for the juice.",
                    "Here's a little something for the service. We will surely come back. Charles?"
                ],
                "leaveWrong": [
                    "My, my! Why would you serve a cocktail of such lowly quality to a woman of my status! There is simply no art, no technique in this!",
                    "…Farewell! Charles, I will be waiting outside!"
                ],
                "leaveWater": [
                    "The individual ingredients had a discrete quality, but I noted a lack of synergy… Charles?"
                ]
            },
            "tip": 10
        },
        {
            "sprite": "Charles",
            "order": "Parti",
            "lines": {
                "greet": [
                    "Yes, dear. We are in a bit of a hurry tonight, after all. And I shouldn't go to bed too late tonight.",
                    "Good evening, bartender. One <b>Parti</b> for me, please."
                ],
                "leaveCorrect": [
                    "Hmm, an excellent Parti indeed. Well, thank you. Farewell and have a nice day."
                ],
                "leaveWrong": [
                    "This is hardly a Parti. I'm afraid you haven't followed the recipe that well. At any rate, farewell and have a nice day."  
                ],
                "leaveWater": [
                    "Hmm…<br>Not bad all in all, but hopefully it'll be better next time. Farewell."
                ]
            },
            "tip": 4
        },
        {
            "sprite": "Betty",
            "order": "Everest",
            "lines": {
                "greet": [
                    "Hi there, …bartender. With these thick glasses I can't make out whether you're a miss or a mister.",
                    "In any case, do me a favor and stay away from men, or you'll end up like me and my ex husband. <size=75%>I did get all the money from the divorce though… hehe.<size=100%>",
                    "Give me an <b>Everest</b>. As cold as his heart."
                ],
                "leaveCorrect": [
                    "Mmm, not bad at all for an amateur. Maybe the person behind the counter is a miss after all.<br>Bye bye!"
                ],
                "leaveWrong": [
                    "Bleah! Pfft! If my ex husband boiled sausage water it would still taste better than this. There must be a man behind this counter, no doubt.<br>Heading out!"
                ],
                "leaveWater": [
                    "Not terrible. I'm still not sure if you're a miss or a mister, so I'll be back some other time. I'll be keeping an eye on you!<br>Bye bye!"
                ]
            },
            "tip": 2
        },
        {
            "sprite": "Kathryn",
            "order": "Parti",
            "lines": {
                "greet": [
                    "TBD",
                    "Parti"
                ],
                "leaveCorrect": [
                    "TBD"
                ],
                "leaveWrong": [
                    "TBD"
                ],
                "leaveWater": [
                    "TBD"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Kenneth",
            "order": "Everest",
            "lines": {
                "greet": [
                    "Good evening, fella. This is a war veteran you're talking to. I'd like an Everest on the rocks.<br>You see, the correct way to make it is to shake it clockwise. And of course, pour half Caledon first, half at the end.",
                    "My drink now, fella. Everest on the rocks. But don't put too much ice in the glass! I know these tricks that young people do…"
                ],
                "leaveCorrect": [
                    "Aaah, how refreshing. This one's especially good, probably because you followed my advice. Hah!<br>At ease, fella! Goodnight!"
                ],
                "leaveWrong": [
                    "Mmm, I'm not sure you followed my instructions. Actually, this tastes like another drink altogether…<br>At ease, fella! Goodnight!"
                ],
                "leaveWater": [
                    "Refreshing, but a bit watered down. Maybe it's the way that the newer generations do it.<br>In any case, at ease, fella! Goodnight!"
                ]
            },
            "tip": 3
        }
    ]
}