{
    "customers": [
        {
            "sprite": "Howard",
            "order": "Wrong",
            "lines": {
                "greet": [
                    "[LUCA][IDEA FOR DIALOGUE] Take care, the prohibition laws have passed. I better not see any drunk person coming out of this bar!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Helene",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "[IDEA FOR DIALOGUE] She says she knows prohibition laws have passed, but that she will keep it discreet"
                ]
            },
            "tip": 8
        },
        {
            "sprite": "Doris",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "[LUCA][IDEA FOR DIALOGUE] By the way, who was that young lady on her way out just now?"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Eugene",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "[LUCA][IDEA FOR DIALOGUE] Will thank bartender for staying open despite the laws"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Willie",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "Well hello hello there! Hope you've read the latest edition of Rogue, it's got some hefty tips on how to dress stylishly! Say, do you like ballet?",
                    "Actually, don't answer! Mysterious is better. Besides, I shouldn't squander too much time before my next competition.",
                    "Honey, make me a <b>Ripple</b>! Maybe with a drop of honey on the rim, like a Spring Bee."
                ],
                "leaveCorrect": [
                    "Oh my, oh my! Just how I love it. If I didn't know any better I'd think you were trying to make an impression on me!<br>Well, I'll definitely be coming back then! See you!"
                ],
                "leaveWrong": [
                    "…Well, it seems you've prepared a different cocktail to gain my attention… and you've succeded! It wasn't bad after all.<br>I'll be seeing you some other time then!"
                ],
                "leaveWater": [
                    "Oh my! Just how I love it, though it seems you've held back on the alcohol a bit.",
                    "I'll be definitely coming back in the future then, see if your cocktails get better and better over time. See you!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Margaret",
            "order": "Parti",
            "lines": {
                "greet": [
                    "TBD"
                ]
            },
            "tip": 3
        },{
            "sprite": "Ernest",
            "order": "Everest",
            "lines": {
                "greet": [
                    "[IDEA FOR DIALOGUE] Will ask how the player is faring after their first 3 days"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Gaston",
            "order": "Magazine",
            "lines": {
                "greet": [
                    "TBD"
                ]
            },
            "tip": 5
        }
    ]
}