{
    "customers": [
        {
            "sprite": "Howard",
            "order": "Wrong",
            "lines": {
                "greet": [
                    "Bartender! Hope I will not see anyone drunk here! The prohibition laws have just passed, and hopefully I will add!",
                    "You know, alcohol is a poison, and I'm glad that the government has finally realized that.",
                    "Before you ask, I'm Howard, but you can call me law. I'm the law. And I will have my revenge on the alcohol industry.",
                    "You will remember my name, bartender.",
                    "I'm Howard.",
                    "Yeah.",
                    "The law of this city."
                ]
            },
            "tip": 0
        },
        {
            "sprite": "Doris",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "I really like the poster you have outside. You know, I work in a book printing factory, so I know a good poster when I see one.", 
                    "Anyway, good to see you again, bartender. Just heard the news about the prohibition laws. I'm glad you're still open, I was worried for you.",
                    "May I ask you for a <b>Ripple</b>, even if it's a bit risky?"
                ],
                "leaveCorrect": [
                    "A perfect Ripple, indeed. I'm glad you are still here, take care of yourself.",
                    "May I ask you for another one for my husband, Eugene? He's waiting for me at the table."
                ],
                "leaveWrong": [
                    "I really understand the situation, and that you are a bit nervous, but this is not a Ripple.",
                    "By the way I won't tell anyone about this, don't worry. Oh, look, my husband is coming."
                ],
                "leaveWater": [
                    "Excuse me if I asked for a Ripple, but I understand the situation. I'll just have this water then.",
                    "My husband doesn't know about the prohibition laws yet, I don't want to worry him. He's a very sensitive person."
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Eugene",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "HEEEEELLO BARTENDER! Oh honey, why the long face?",
                    "WHAAAAT? Prohibition laws? Oh, I see. Well, I'm glad you're still open.",
                    "So can I really get a <b>Ripple</b> here? If it's not too much trouble, of course. In that case... I can just... pass."
                ],
                "leaveCorrect": [
                    "THIS IS A RIPPLE! <size=75%><i>Oh, I mean, this is a Ripple.</i><size=100%>",
                    "See you soon for another cup of water, you know what I mean? <size=75%><i>wink wink</i><size=100%>"
                ],
                "leaveWrong": [
                    "Oh man, your drinks are always good. I mean, it's not like the one I'm used to, but alcohol is alcohol, right?"
                ],
                "leaveWater": [
                    "Oh, I see. I understand if you can't make alcohol anymore. I'll just have this water then.",
                    "And I mean, I really like it. It's a good cup of water. A very good cup of water."
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Willie",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "Well hello hello there! Hope you've read the latest edition of Rogue, it's got some hefty tips on how to dress stylishly! Say, do you like ballet?",
                    "Actually, don't answer! Mysterious is better. Besides, I shouldn't squander too much time before my next competition.",
                    "Honey, make me a <b>Ripple</b>! Maybe with a drop of honey on the rim, like a Spring Bee."
                ],
                "leaveCorrect": [
                    "Oh my, oh my! Just how I love it. If I didn't know any better I'd think you were trying to make an impression on me!<br>Well, I'll definitely be coming back then! See you!"
                ],
                "leaveWrong": [
                    "…Well, it seems you've prepared a different cocktail to gain my attention… and you've succeded! It wasn't bad after all.<br>I'll be seeing you some other time then!"
                ],
                "leaveWater": [
                    "Oh my! Just how I love it, though it seems you've held back on the alcohol a bit.",
                    "I'll be definitely coming back in the future then, see if your cocktails get better and better over time. See you!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Margaret",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "Oh, wonderful to see you again, dear bartender! My day was so busy that I almost forgot to come here.",
                    "But it improved when I found out Davidine Betty will attend the ball tonight, right here in Korgis. If only I could attend too...",
                    "May I get a <b>Spring Bee</b>, please?"
                ],
                "leaveCorrect": [
                    "Perfect cocktail, dear bartender. I wonder when this recipe was invented...<br>I shall go home now, and rehearse some lines. Goodnight!"
                ],
                "leaveWrong": [
                    "Oh... I'm afraid this is not the right cocktail.<br>It's alright, I'll come back another day... Goodnight, bartender!"
                ],
                "leaveWater": [
                    "Thank you, dear bartender.<br>Well, I might go home now and rehearse some lines... Goodnight!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Kenneth",
            "order": "Everest",
            "lines": {
                "greet": [
                    "Welcome back, fella. Chaotic week, this one, for the government. Aaalways up to no good.<br>Well? Will you make me an <b>Everest</b>?"
                ],
                "leaveCorrect": [
                    "Aaah, just how I like it. Thank you very much, and here's a tip for your work.<br>Goodnight, fella! And always learn from the adults!"
                ],
                "leaveWrong": [
                    "Argh, this is terrible... Are you sure you're following the recipe?<br>I'll be off now. Goodnight."
                ],
                "leaveWater": [
                    "Refreshing for sure, and I'm sure it could taste even better. You do need more experience...<br>In any case, at ease, fella! Goodnight!"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Gaston",
            "order": "Magazine",
            "lines": {
                "greet": [
                    "<i>Bonsoir, barman</i>. This establishment was recommended to me by a trusted client.",
                    "You may want to consider investing in alcohol stocks by the way… Prices have been increasing lately, what with the debates in the government.",
                    "I would like to try out a <b>Magazine</b> now, <i>s'il vous plaît</i>."
                ],
                "leaveCorrect": [
                    "Excellent cocktail, barman. It seems I'll recommend this place to someone else in turn. <size=75%>I wonder if I could spend some bonding time with my son here…<size=100%><br><i>Bonne nuit</i>, barman."
                ],
                "leaveWrong": [
                    "I'm confused. I thought this was a different type of bar. Maybe you've made the wrong cocktail because you got afraid of me.<br>I may retry in the future. <i>Au revoir</i>."
                ],
                "leaveWater": [
                    "Oh. A watered drink.<br>Not the best of impression, and not very polite. But as a fellow <i>entrepreneur</i> I understand the necessity. Have a good night, <i>au revoir</i>."
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Charles",
            "order": "Parti",
            "lines": {
                "greet": [
                    "Good to see you again there. It seems like this place is picking up the pace with the customers, even though you've new in the neighborhood.",
                    "One <b>Parti</b> for me, please. And <i>shaken, not stirred</i>, if it's not too much to ask."
                ],
                "leaveCorrect": [
                    "A fantastic drink, no doubt. It's nice to come here after work and find this welcoming atmosphere.<br>Oh, I'm overstaying my welcome. Have a good night."
                ],
                "leaveWrong": [
                    "This is hardly a Parti. I'm afraid you haven't followed the recipe that well. At any rate, farewell and have a nice day."
                ],
                "leaveWater": [
                    "Nice drink. It's nice to come here after work to unwind a little bit. Thank you and have a good night."
                ]
            },
            "tip": 4
        },
        {
            "sprite": "Betty",
            "order": "Everest",
            "lines": {
                "greet": [
                    "Well, hello again. I didn't notice it before but that plant over there is very pretty. It would fit well in my house.<br><size=75%>...or is it part of the wallpaper? I can't tell.<size=100%>",
                    "An <b>Everest</b> for me now! I don't have all day."
                ],
                "leaveCorrect": [
                    "You've improved from the last time I was here! But I'll have you know you still have a long way to go.<br>Bye bye!"
                ],
                "leaveWrong": [
                    "Pah! Definitely a downgrade from last time! Heading out now!"
                ],
                "leaveWater": [
                    "You haven't improved much from the last time I was here. I'll have you know you still have a long way to go!<br>Bye bye!"
                ]
            },
            "tip": 2
        },
        {
            "sprite": "Kathryn",
            "order": "Parti",
            "lines": {
                "greet": [
                    "Hello again! I'm not sure what brought me to this street again today, but I sure am glad to be here. This bar's energy is a mystery I want to solve.",
                    "I'm not a sophisticate drinker <size=75%>(I usually down pints in England...)<size=100%> but I've been pushing my boundaries a bit. Can you get me a <b>Parti</b>?"
                ],
                "leaveCorrect": [
                    "Cheers! Better than a pint, innit?<br>Listen, I need to "
                ],
                "leaveWrong": [
                    "TBD"
                ],
                "leaveWater": [
                    "TBD"
                ]
            },
            "tip": 3
        }
    ]
}