{
    "customers": [
        {
            "sprite": "Howard",
            "order": "Wrong",
            "lines": {
                "greet": [
                    "Bartender! Hope I will not see anyone drunk here! The prohibition laws have just passed, and hopefully I will add!",
                    "You know, alcohol is a poison, and I'm glad that the government has finally realized that.",
                    "Before you ask, I'm Howard, but you can call me law. I'm the law. And I will have my revenge on the alcohol industry.",
                    "You will remember my name, bartender.",
                    "I'm Howard.",
                    "Yeah.",
                    "The law of this city."
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Helene",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "[IDEA FOR DIALOGUE] She says she knows prohibition laws have passed, but that she will keep it discreet"
                ]
            },
            "tip": 8
        },
        {
            "sprite": "Doris",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "I really like the poster you have outside. You know, I work in a book printing factory, so I know a good poster when I see one.", 
                    "Anyway, good to see you again, bartender. Just heard the news about the prohibition laws. I'm glad you're still open, I was worried for you.",
                    "May I ask you for a <b>Ripple</b>, even if it's a bit risky?"
                ],
                "leaveCorrect": [
                    "A perfect Ripple, indeed. I'm glad you are still here, take care of yourself.",
                    "May I ask you for another one for my husband, Eugene? He's waiting for me at the table."
                ],
                "leaveWrong": [
                    "I really understand the situation, and that you are a bit nervous, but this is not a Ripple.",
                    "By the way I won't tell anyone about this, don't worry. Oh, look, my husband is coming."
                ],
                "leaveWater": [
                    "Excuse me if I asked for a Ripple, but I understand the situation. I'll just have this water then.",
                    "My husband doesn't know about the prohibition laws yet, I don't want to worry him. He's a very sensitive person."
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Eugene",
            "order": "Ripple",
            "lines": {
                "greet": [
                    "HEEEEELLO BARTENDER! Oh honey, why the long face?",
                    "WHAAAAT? Prohibition laws? Oh, I see. Well, I'm glad you're still open.",
                    "So can I really get a <b>Ripple</b> here? If it's not too much trouble, of course. In that case... I can just... pass."
                ],
                "leaveCorrect": [
                    "THIS IS A RIPPLE! <size=75%><i>Oh, I mean, this is a Ripple.</i><size=100%>",
                    "See you soon for another cup of water, you know what I mean? <size=75%><i>wink wink</i><size=100%>"
                ],
                "leaveWrong": [
                    "Oh man, your drinks are always good. I mean, it's not like the one I'm used to, but alcohol is alcohol, right?"
                ],
                "leaveWater": [
                    "Oh, I see. I understand if you can't make alcohol anymore. I'll just have this water then.",
                    "And I mean, I really like it. It's a good cup of water. A very good cup of water."
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Willie",
            "order": "SpringBee",
            "lines": {
                "greet": [
                    "Well hello hello there! Hope you've read the latest edition of Rogue, it's got some hefty tips on how to dress stylishly! Say, do you like ballet?",
                    "Actually, don't answer! Mysterious is better. Besides, I shouldn't squander too much time before my next competition.",
                    "Honey, make me a <b>Ripple</b>! Maybe with a drop of honey on the rim, like a Spring Bee."
                ],
                "leaveCorrect": [
                    "Oh my, oh my! Just how I love it. If I didn't know any better I'd think you were trying to make an impression on me!<br>Well, I'll definitely be coming back then! See you!"
                ],
                "leaveWrong": [
                    "…Well, it seems you've prepared a different cocktail to gain my attention… and you've succeded! It wasn't bad after all.<br>I'll be seeing you some other time then!"
                ],
                "leaveWater": [
                    "Oh my! Just how I love it, though it seems you've held back on the alcohol a bit.",
                    "I'll be definitely coming back in the future then, see if your cocktails get better and better over time. See you!"
                ]
            },
            "tip": 5
        },
        {
            "sprite": "Margaret",
            "order": "Parti",
            "lines": {
                "greet": [
                    "TBD"
                ]
            },
            "tip": 3
        },{
            "sprite": "Ernest",
            "order": "Everest",
            "lines": {
                "greet": [
                    "[IDEA FOR DIALOGUE] Will ask how the player is faring after their first 3 days"
                ]
            },
            "tip": 3
        },
        {
            "sprite": "Gaston",
            "order": "Magazine",
            "lines": {
                "greet": [
                    "TBD"
                ]
            },
            "tip": 5
        }
    ]
}