[
    {
        "sprite": "Howard",
        "order": "None",
        "lines": {
            "greet": [
                "Bartender! Hope I won't see anyone drunk here! The prohibition laws have just passed, and thankfully, might I add!",
                "You know, alcohol is a poison, and I'm glad that the government has finally realized that.",
                "Before you ask, I'm Howard, but you can call me law. I'm the law. And I will have my revenge on the alcohol industry.",
                "You will remember my name, bartender.",
                "I'm Howard.",
                "Yeah.",
                "The law of this city."
            ]
        },
        "tip": 0
    },
    {
        "sprite": "Doris",
        "order": "Ripple",
        "lines": {
            "greet": [
                "[IF HAS POSTERS]Good evening. I really like the poster you have outside. You know, I work in a book printing factory, so I know a good poster when I see one.",
                "[IF HAS POSTERS]{POSTER 2}Here, a spare one from my workplace. We've stopped producing posters with alcoholic beverages on them now, so I don't need it anymore.",
                "[IF DOESN'T HAVE POSTERS]Good evening and good to see you, bartender. Just heard the news about the prohibition laws. I'm glad you're still open, I was worried for you.",
                "May I ask you for a <b>Ripple</b>, even if it's a bit risky?"
            ],
            "correct": [
                "A perfect Ripple, indeed. I'm impressed that you have the courage to stay open. Take care of yourself.",
                "May I ask you for another one for my husband, Eugene? He's waiting for me at the table."
            ],
            "wrong": [
                "I really understand the situation, and that you are a bit nervous, but this is not a Ripple.",
                "By the way I won't tell anyone about this, don't worry. Oh, look, my husband is coming."
            ],
            "water": [
                "Excuse me if I asked for a Ripple, I understand the situation. I'm impressed you have the courage to stay open. Take care of yourself.",
                "My husband doesn't know about the prohibition laws yet, I don't want to worry him. He's a very sensitive person."
            ]
        },
        "tip": 1
    },
    {
        "sprite": "Eugene",
        "order": "Ripple",
        "lines": {
            "greet": [
                "HEEEEELLO BARTENDER! Oh honey, why the long face?",
                "WHAAAAT? Prohibition laws? Oh, I see. Well, I'm glad you're still open.",
                "So can I really get a <b>Ripple</b> here? If it's not too much trouble, of course. In that case… I can just… pass."
            ],
            "correct": [
                "THIS IS A RIPPLE! <size=75%><i>Oh, I mean, this is a Ripple.</i><size=100%>",
                "See you soon for another cup of water, you know what I mean? <size=75%><i>*wink wink*</i><size=100%>"
            ],
            "incorrect": [
                "Oh man, your drinks are always good. I mean, it's not like the one I'm used to, but alcohol is alcohol, right?"
            ],
            "wrong": [
                "Not bad! Mayyybe not my taste though… I mean, it's not like the one I'm used to, but alcohol is alcohol, right?"
            ],
            "water": [
                "Not a bad Ripple at all! Your drinks are always nice!<br>Oh, uh, I mean…",
                "It's a good cup of water. A veeery good cup of water. <i>*wink*</i> Bye now!"
            ]
        },
        "tip": 3
    },
    {
        "sprite": "Luke",
        "order": "Palmera",
        "tip": 3,
        "lines": {
            "greet": [
                "Hi… I was walking by and noticed this bar was still open despite everything. You're doing the good thing, nobody is actually in favor of prohibition.",
                "Though, I expected to find my good friend Ernest behind the counter, hah! Maybe he retired…?",
                "Anyway… I'm a bit nervous tonight, so I need that bit of booze… Can you make me a <b>Palmera</b>?"
            ],
            "correct": [
                "Perfect! <size=75%>Okay Luke… You can do it… Just walk up to her and, uh… <size=100%> Oh! Uh, I gotta go! Here's a tip for you, thanks again and bye!"
            ],
            "water": [
                "Nice! <size=75%>Okay Luke… You can do it… Just walk up to her and, uh… <size=100%> Uh, I gotta go! Here's a small tip for you, thanks again and bye!"
            ],
            "incorrect": [
                "Good enough, I guess! <size=75%>Okay Luke… You can do it… <size=100%> Well, I gotta go! Thanks and bye!"
            ],
            "wrong": [
                "Oh, that's not what I expected… Well, I gotta go! Thanks and bye!"
            ]
        }
    },
    {
        "sprite": "Gaston",
        "order": "Magazine",
        "tip": 5,
        "lines": {
            "greet": [
                "<i>Bonsoir</i>, barman. This establishment was recommended to me by a trusted client.",
                "You may want to consider investing in alcohol stocks by the way… Prices have been increasing lately with the prohibition law. It's still not illegal to consume it, however.",
                "Now, I would like to try out a <b>Magazine</b>, <i>s'il vous plaît</i>."
            ],
            "correct": [
                "A discrete Ferrucci in this Magazine. I see we have similar tastes in wine.",
                "{TRINKET 1}Here, a small <i>souvenir</i> from my business. It will get me some publicity if you hang it in your bar.<br>Anyway, <i>bonne nuit</i>, barman."
            ],
            "water": [
                "An exceptional Ferrucci in this Magazine. I see we have similar tastes in wine. It's hard to find good wine in this part of the United States, unfortunately.",
                "{TRINKET 1}Here, a small <i>souvenir</i> from my business. It will get me some publicity if you hang it in your bar.<br>Anyway, <i>bonne nuit</i>, barman."
            ],
            "incorrect": [
                "Close enough, barman. I wish Americans would follow the original French recipe for the Magazine. In any case, I wish you a good night."
            ],
            "wrong": [
                "All wrong, barman. I wish Americans would follow the original French recipe for the Magazine. In any case, I wish you a good night."
            ]
        }
    },
    {
        "sprite": "Willie",
        "order": "SpringBee",
        "orderOnPostIt": "Ripple…???",
        "lines": {
            "greet": [
                "Well hello hello there! Hope you've read the latest edition of Rogue, it's got some hefty tips on how to dress stylishly!",
                "In any case, I shouldn't squander too much time before my next competition. Honey, make me a <b>Ripple</b>!",
                "But with Verlan instead of Caledon, I like the bitterness of it. Oh, and no Gryte… Just add some more Verlan to it."
            ],
            "correct": [
                "Oh my, oh my! Just how I love it. If I didn't know any better I'd think you were trying to make an impression on me!<br>Well, I'll definitely be coming back then! See you!"
            ],
            "Ripple": [
                "Oh my! That is not what I asked at all! It tastes like a Ripple. Is it possible you were… distracted by something else?<br>Well, I'll definitely be coming back then! See you!"
            ],
            "wrong": [
                "Well, it seems you've prepared a different cocktail to gain my attention… and you've succeeded! It wasn't bad after all.<br>I'll be seeing you some other time then!"
            ],
            "water": [
                "Oh my! Just how I love it, though it seems you've held back on the alcohol a bit.",
                "I'll be definitely coming back in the future then, see if your cocktails get better and better over time. See you!"
            ]
        },
        "tip": 4
    },
    {
        "sprite": "Charles",
        "order": "Parti",
        "lines": {
            "greet": [
                "Good to see you again there. It seems like this place is picking up the pace with the customers, even though you're new in the neighborhood.",
                "One <b>Parti</b> for me, please. And <i>shaken, not stirred</i>, if it's not too much to ask."
            ],
            "correct": [
                "A fantastic drink, no doubt. It's nice to come here after work and find this welcoming atmosphere.<br>Oh, I'm overstaying my welcome. Have a good night."
            ],
            "wrong": [
                "This is hardly a Parti. I'm afraid you haven't followed the recipe that well. At any rate, farewell and have a nice day."
            ],
            "water": [
                "Nice drink. It's nice to come here after work to unwind a little bit. Thank you and have a good night."
            ]
        },
        "tip": 4
    },
    {
        "sprite": "Betty",
        "order": "Everest",
        "lines": {
            "greet": [
                "Well, hello again. I didn't notice it before but that plant over there is very pretty. It would fit well in my house.<br><size=75%>…or is it part of the wallpaper? I can't tell.<size=100%>",
                "An <b>Everest</b> for me now! I don't have all day."
            ],
            "correct": [
                "The quality has improved from the last time I was here! But I'll have you know you still have a long way to go.<br>Bye bye!"
            ],
            "wrong": [
                "Pah! Definitely a downgrade from the last time I was here! Heading out now!"
            ],
            "water": [
                "The quality hasn't improved much from the last time I was here. I'll have you know you still have a long way to go!<br>Bye bye!"
            ]
        },
        "tip": 1
    },
    {
        "sprite": "Margaret",
        "order": "Palmera",
        "lines": {
            "greet": [
                "Oh, wonderful to see you again, dear bartender! My day was so busy that I almost forgot to come here.",
                "But it improved when I found out <i>Eliza Davids</i> will attend the ball tonight, right here in Korgis. If only I could attend too…",
                "May I get a <b>Palmera</b>, please? I've heard bars are still selling alcohol despite the law…"
            ],
            "correct": [
                "Perfect cocktail, dear bartender. I'd like to order another one, but I don't wish to overstay my welcome here… Maybe I'll visit another bar…<br>Goodnight!"
            ],
            "wrong": [
                "Oh… I'm afraid this is not the right cocktail.<br>It's alright, I'll come back another day… Goodnight, bartender!"
            ],
            "water": [
                "Thank you, dear bartender.<br>Well, I might go home now and rehearse some lines… Goodnight!"
            ]
        },
        "tip": 2
    }
]