[
    {
        "sprite": "Helene",
        "order": "Palmera",
        "tip": 5,
        "lines": {
            "greet": [
                "Good evening. I found myself in the vicinity of {BAR NAME} again, since I'm on my way to the theater.",
                "<b>Margaret Brookside</b> should perform tonight. You <i>do</i> know her, I hope. I wonder what her favorite cocktail would be…",
                "Perhaps a flowery <b>Palmera</b>?"
            ],
            "correct": [
                "Truly splendid. And just in time for my very important event. Have a pleasant evening, bartender."
            ],
            "water": [
                "Splendid, but it could be improved somewhat. I'm sure Margaret would agree. Anyway, have a pleasant evening, bartender."
            ],
            "incorrect": [
                "I… don't think this is quite what Margaret would drink. I may have to ask her directly, then… Have a pleasant evening, bartender."
            ],
            "wrong": [
                "I do not think this is what Margaret would drink. <i>At all</i>. Well, my driver is waiting for me outside, so… Have a plesant evening."
            ]
        }
    },
    {
        "sprite": "Kenneth",
        "order": "Everest",
        "lines": {
            "greet": [
                "Good evening, fella. This is a war veteran you're talking to. I'd like an <b>Everest</b> on the rocks.",
                "You see, the correct way to make it is to shake it clockwise. And of course, pour half Caledon first, half at the end.",
                "My drink now, fella. But don't put too much ice in the glass! I know these tricks that young people do…"
            ],
            "correct": [
                "Aaah, how refreshing. This one's especially good, probably because you followed my advice. Hah!<br>At ease, fella! Goodnight!"
            ],
            "wrong": [
                "Mmm, I'm not sure you followed my instructions. Actually, this tastes like another drink altogether…<br>At ease, fella! Goodnight!"
            ],
            "water": [
                "Refreshing, a bit too much for my taste. Maybe it's the way that the newer generations do it.<br>In any case, at ease, fella! Goodnight!"
            ]
        },
        "tip": 1
    },
    {
        "sprite": "ErnestUnion",
        "order": "None",
        "tip": 0,
        "lines": {
            "greet": [
                "Greetings! I hope you received our slip of paper on the shop window earlier. Oh, where are my manners…",
                "I speak to you as representative of the <b>bartenders union</b>. It is no secret that our members have been brought to their knees by the prohibition law…",
                "But we're adamant on resisting, and we will find a way to stay open. I ask for patience, young one… But in the meantime, good luck!"                        
            ]
        }
    },
    {
        "sprite": "Margaret",
        "order": "SpringBee",
        "tip": 2,
        "lines": {
            "greet": [
                "Dearest bartender! How good to see you again! Oh, I am <i>so</i> anxious tonight… I wish I could just take a teeny, tiny break from all my chores.",
                "But thankfully, you decided to stay open in spite of the prohibition laws. I'm so glad! I could really use a strong <b>Spring Bee</b> right now…"                    
            ],
            "correct": [
                "{MARGARET GETS DRUNK}Thank you, thank you, thank you! But the dread won't leave my thoughts… What shall I do? Maybe try drinking a little bit more?",
                "No matter… Because for some reason, I feel like I did the right thing, coming here tonight. Au revoir, dearest bartender."
            ],
            "water": [
                "Thank you, thank you, thank you! To be honest I wished to drink some more, but I feel somewhat full already.",
                "No matter… Because for some reason, I feel like I did the right thing, coming here tonight. Au revoir, dearest bartender."
            ],
            "incorrect": [
                "Thank you, I feel better, but the dread won't leave my thoughts… What shall I do?",
                "No matter, and this is certainly not something I want to bore you with, dear bartender. Have a good night! "
            ],
            "wrong": [
                "Well, thank you… I think I have to go to the theater now. Au revoir, dear bartender."
            ]
        }
    },
    {
        "sprite": "Eugene",
        "order": "Ripple",
        "tip": 2,
        "lines": {
            "greet": [
                "Gooooood evening! I hope you're doing good today! I stopped by for a quick <b>Ripple</b> after work.",
                "Doris isn't with me today. Well, she was fired! Her company is not doing well at all because of the prohibition, and they're cutting on staff!",
                "She's a bit down lately, so I can't wait to come back home now and give her a hug! Anyway, could I get my <b>Ripple</b> now?"                  
            ],
            "correct": [
                "WOW!! Awesome as always! Thank you so much, I'll scoot right off to Doris now! Good evening!"
            ],
            "water": [
                "Wow, nice  as always! Thank you so much, I'll scoot right off to Doris now! Good evening!"
            ],
            "incorrect": [
                "Wow, not bad. This Ripple tastes very original! I'll scoot right off to Doris now, good evening!"
            ],
            "wrong": [
                "Not bad, this Ripple tastes very… original. Anyway, I'm heading off to Doris now, good evening."
            ]
        }
    },
    {
        "sprite": "Betty",
        "order": "Barber",
        "tip": 2,
        "lines": {
            "greet": [
                "Evening. Still open, I see. Your cocktail wasn't <i>too</i> bad last time, so I decided to come by again.",
                "Well? Can you serve me a <b>Barber</b> or no?"                  
            ],
            "correct": [
                "Well I'll be, this is not bad at all! Youngling, I think you might start to get the hang of it.",
                "{TRINKET 2}Here, take this. And don't complain. It's simply a small gift. This place really needs some decorations either way.<br>I'm off now! Goodnight."
            ],
            "water": [
                "Not bad, not bad. I think you're starting to get the hang of it.<br> Well, I'm off now. Goodnight."
            ],
            "incorrect": [
                "I might be in the age of retirement, but I'm not naïve: this isn't a <b<Barber</b>. Do better next time! Goodnight!"
            ],
            "wrong": [
                "I might be in the age of retirement, but I'm not stupid: this isn't a <b<Barber</b>, and on top of that, it tastes awful! Do better next time, goodnight!"
            ]
        }
    },
    {
        "sprite": "Kathryn",
        "order": "Parti",
        "tip": 4,
        "lines": {
            "greet": [
                "Good to see you, love! This place keeps getting better and better. And more crowded, even!<br>Alright now, can I get a <b>Parti</b>?"                
            ],
            "correct": [
                "Terrific. Y'know, I might even start to regret the end of my exchange studies at the <b>Korgis University</b>. I might miss this place!",
                "Have a good night, and don't close up too late!"
            ],
            "water": [
                "Cheers. Y'know, I might even start to regret the end of my exchange period at the <b>Korgis University</b>. I might even miss this place!",
                "Have a good night, and don't close up too late!"
            ],
            "incorrect": [
                "Cheers, not bad. Y'know, I might even start to regret the end of my exchange period at the <b>Korgis University</b>… Goodnight, love."
            ],
            "wrong": [
                "I think I'll skip this one, love. Sorry, just not my cup of tea. Goodnight!"
            ]
        }
    },
    {
        "sprite": "Gaston",
        "order": "Magazine",
        "tip": 5,
        "lines": {
            "greet": [
                "<i>Coucou</i>! Are you still open, bartender? It is quite late, you know. But entrepreneurs like us rarely get enough sleep.",
                "A <b>Magazine</b> now, <i>s'il vous plaît</i>."           
            ],
            "correct": [
                "Thank you for following the recipe exactly, bartender. The wine you used… It reminds me of how they make them in Bordeaux.",
                "<i>Merci</i>, and goodnight."
            ],
            "water": [
                "Pleasant flavour. The wine you used… It reminds me of a familiar taste, but I can't quite say what.",
                "<i>Merci</i>, and goodnight."
            ],
            "wrong": [
                "I'm afraid it's not what I asked, bartender. A bit disappointing. But have a good night nonetheless."
            ]
        }
    }
]
