[
    {
        "sprite": "MafiaGoon",
        "order": "None",
        "tip": 0,
        "lines": {
            "greet": [
                "'Sup, boyo. Everything running smoothly, don't ya worry. Supplies have arrived an' all. Just here to warn you, though…",
                "The government has put some funding on folks that agree to <b>snitch on bars</b> and speakeasies that still try to serve alcohol, like you.",
                "So keep your eyes peeled, as they say, and watch out for folks that might be looking to make a quick buck, or that <i>really</i> want to get drunk.",
                "I'll be around, boyo. See ya."
            ]
        }
    },
    {
        "sprite": "Kenneth",
        "order": "Everest",
        "tip": 2,
        "lines": {
            "greet": [
                "Well, well, fella! Lovely weather tonight. The sky is clear, and one can almost see the stars and constellations.",
                "You know, when I was serving in the army during the war, sometimes I would look up at the sky and I would see no stars, because of all the smoke.",
                "Well, I miss some aspects of the military, but the smoke screens are not one of them. Either way, can you make me an <b>Everest</b> now?"
            ],
            "correct": [
                "This… law that they passed, it's like a smoke screen. Alcohol will always be a part of our lives, and this law won't stop it. It's futile.",
                "It just makes life harder for you bartenders. But thankfully, young people like you know what's right and what's not.",
                "{TRINKET 4}This… is for you. Take good care of it. And goodnight."
            ],
            "water": [
                "This… law that they passed, it's like a smoke screen. Alcohol will always be a part of our lives, and this law won't stop it. It's futile.",
                "It just makes life harder for you bartenders. But thankfully, young people like you know what's right and what's not.",
                "{TRINKET 4}This… is for you. Take good care of it. And goodnight."
            ],
            "wrong": [
                "Still some improvement to be made with your cocktails, fella… This here is not an Everest, I think.",
                "Well, in any case… Take good care, and goodnight."
            ]
        }
    },
    {
        "sprite": "Kathryn",
        "order": "Parti",
        "tip": 3,
        "lines": {
            "greet": [
                "TBD"
            ],
            "correct": [
                "TBD"
            ],
            "water": [
                "TBD"
            ],
            "wrong": [
                "TBD"
            ]
        }
    },
    {
        "sprite": "Doris",
        "order": "Ripple",
        "tip": 0,
        "lines": {
            "greet": [
                "TBD"
            ],
            "correct": [
                "TBD"
            ],
            "water": [
                "TBD"
            ],
            "wrong": [
                "TBD"
            ]
        }
    },
    {
        "sprite": "Luke",
        "order": "Magazine",
        "tip": 2,
        "lines": {
            "greet": [
                "TBD"
            ],
            "correct": [
                "TBD"
            ],
            "water": [
                "TBD"
            ],
            "wrong": [
                "TBD"
            ]
        }
    },
    {
        "sprite": "Helene",
        "order": "Palmera",
        "tip": 6,
        "lines": {
            "greet": [
                "TBD"
            ],
            "correct": [
                "TBD"
            ],
            "water": [
                "TBD"
            ],
            "wrong": [
                "TBD"
            ]
        }
    },
    {
        "sprite": "Charles",
        "order": "Barber",
        "tip": 5,
        "lines": {
            "greet": [
                "TBD"
            ],
            "correct": [
                "TBD"
            ],
            "water": [
                "TBD"
            ],
            "wrong": [
                "TBD"
            ]
        }
    },
    {
        "sprite": "MafiaGoon",
        "order": "None",
        "tip": 0,
        "lines": {
            "greet": [
                "Look who it is! How goes it? Met any snitches? Well, surely not, 'cause I told you about them in time.",
                "I basically… snitched on a snitch. Whoops. Anyway.",
                "I gave you a helping hand today, I'm supplying you on time and with stable prices… Now it's time that you do <i>your part of the deal</i>.",
                "You know… it's not cheap to look after all our business partners and such. So a little sum is all I ask. I'd say something like <b>$50</b>.",
                "Good deal if you ask me. That undercover snitch could've made you close up for good if you hadn't known any better. So, do you have the money?"
            ],
            "choices": [
                "Give money",
                "Don't give money"
            ],
            "choice1": [
                "{PAYOFF ACCEPTED}Awesome"
            ],
            "choice2": [
                "Get fucked"
            ]
        }
    }
]
