[
    {
        "lines": {
            "greet": [
                "KORGIS POLICE, OPEN UP!",
                "Ohh, good morning bartender, what are we doing here?",
                "Glasses... water... I don't see any alcohol here... in fact, I don't see anything at all.",
                "Can I say, I don't blame you, expenses are huge these days, I can't even afford to eat out... I was a wondering what is the biggest expense in a bar these days."
            ],
            "choices": [
                "Alchol supplies",
                "Electricity, gas and rent"
            ],
            "correct": [
                "I would have bet on it, I don't dare to imagine how much you spend to keep a place like this up, with all these lights...",
                "Anyway, I must get back to my work, you never know where these crooks can hide."
            ],
            "wrong": [
                "AHAHAHAHAHHAHAH NICE CATCH! Aren’t you funny bartender?",
                "...........",
                "Unless... Mmmmm, when I think about it, that is a very strange thing to say... especially after the prohibitionism.",
                "Let’s hope you were joking, the law is always watching you, bartender."
            ]
        },
        "correctChoice": 1
    },
    {
        "lines": {
            "greet": [
                "KORGIS POLICE! PUT YOUR HANDS ON THE TABLE!",
                "Here again? do you want to explain to me why people keep segnaling this bar?",
                "Maybe you’ve something to hide... even if I don’t see nothing here... AGAIN.",
                "Anyway I have to continue my job, just in case please advise me in case you see someone servong alcohol, this will be nice way to be a korgis cictizen and help the law"
            ],
            "choices": [
                "You can be sure, sir",
                "Who does the spy is not son of Mary"
            ],
            "correct": [
                "That’s diligent citizen, respecful of the law (<i>me</i>) and the authorities."
            ],
            "wrong": [
                "I know that way of saying things is Italian, isn't it? I bet you're one of them...",
                "Damn those Italian, alwyas mafia, pizza, pasta, mandolino... all involved in nasty business.",
                "Let's hope you're just saying that, otherwise I'll have to cuff you next time."
            ]
        },
        "correctChoice": 0
    }
]
