[
  {
    "lines": {
      "greet": [
        "Caledon, gryte and verlan: if the Korgis police see you with this, you won't be having any fun!",
        "Good morning bartenders, my department is trying to find new ways to scare the bar owners during our blitz.",
        "Other departments are not as funny as us, even though they find more and more bartenders serving alcohol than us... those smartasses.",
        "But we're funnier, aren't we?"
      ],
      "choices": [
        "Well, you are a police inspector, so... no?",
        "Yes, it's always a pleasure!"
      ],
      "correct": [
        "I knew it, I saw it worked by looking at your petrified face when i bursted into your store eheh.",
        "Keep up the good work, see you next time."
      ],
      "wrong": [
        "I call it insulting a public official, bartender. You can't talk to me like that...you can't talk to THE LAW like that.",
        "<size=75%><i>so you are just like the others... sob</i><size=100%>",
        "You're lucky I'm in a good mood today and I have other things to do, but we'll see each other again, I feel it"
      ]
    },
    "correctChoice": 1
  },
  {
    "lines": {
      "greet": [
        "Damn you have very strong doors bartender, i should ask your supplier. <size=75%><i>*why I keep distracting myself with dumb stuff, anyway*</i><size=100%>",
        "Bartender, the print is distributing fake news about some undercover people who are going to undercover bars asking for a cocktail, did you heard something about it? did you find anything weird about your customers lately? don’t you find funny that i’m for the second time here today? and i don’t want to order a coffee."
      ],
      "choices": [
        "Not really, and I'm sorry you're not ordering coffee",
        "Yes! I've heard about it and some of them have come here."
      ],
      "correct": [
        "Bartender, I cannot drink when I am on duty, you should know it or other police ispectors are coming here during working hours? I need to check."
      ],
      "wrong": [
        "Mhhhhhhhh.... that is suspicious.",
        "If they came here they should have a reason, don't you serve alcohol, my tense and mysterious bartender?",
        "We'll see... if that's the case, jail is waiting for you."
      ]
    },
    "correctChoice": 0
  }
]
