[
    {
        "lines": {
            "greet": [
                "Bartendeeeeer, I know what you're doing, hands up!",
                "Oh… This seems like a normal bar, though… No alcohol to be seen. Damn those kids, they pranked me again, they will learn to respect me, the law.",
                "You know, they always use this popular saying nowadays. It was something along the lines of to <i>\"I have to see a man…\"</i>"
            ],
            "choices": [
                "<i>\"…pick a flower\"</i>.",
                "<i>\"…about a dog\"</i>."
            ],
            "correct": [
                "No, no, I’m sure it was something else… Well it'll come up to my mind sooner or later.",
                "Now I have to go, the law needs me."
            ],
            "wrong": [
                "Hmm… Weird that you know it, bartender, this is not that common at all.",
                "You're not serving alcohol here, are you?",
                "You better not… I'm keeping an eye on you."
            ]
        },
        "correctChoice": 0
    },
    {
        "lines": {
            "greet": [
                "Good morning bartender, how are you doing here in this nasty place of a bar?",
                "Oh, I was already here today, that's suspicious… but I didn't find anything here before.",
                "Ugh, those kids again, they don't understand how bad it is to talk about alcohol just like that, freely, they don't know what it did to my mother… <size=75%><i>*crickets*</i><size=100%>",
                "Uhm… anyway, what do you think about it?"
            ],
            "choices": [
                "I don’t think alcohol is that bad at all…",
                "Yes, it’s absoluteley dangerous, sir!"
            ],
            "correct": [
                "I knew you could understand me and my pain, you’re a nice guy… girl… person!",
                "Let's hope we meet again, maybe I'll come here for a coffee one day."
            ],
            "wrong": [
                "That's a very strange thing to say, don't you realise you're standing in front of a police inspector?",
                "And you say that to me after what I've told you about <i>my mother</i>!",
                "The next time you make a statement like that, I'll put you in <i>jail</i>, so keep an eye out, bartender."
            ]
        },
        "correctChoice": 1
    }
]
