[
    {
        "lines": {
            "greet": [
                "KORGIS POLICE, OPEN UP!",
                "Oooh, good morning bartender, what do we have here?",
                "Glasses… water… I don't see any alcohol here… in fact, I don't see anything at all on the counter.",
                "Well, I don't blame you, expenses are huge these days, I can't even afford to eat out… I was a wondering what the biggest expense is in a bar these days."
            ],
            "choices": [
                "Alchol supplies.",
                "Electricity, gas and rent."
            ],
            "correct": [
                "I'd have bet on it, I don't dare to imagine how much you spend to keep a place like this up, with all these lights…",
                "Anyway, I must get back to my work, you never know where these crooks can hide."
            ],
            "wrong": [
                "HAHAHAHAHA, NICE CATCH! Aren’t you funny, bartender?",
                ".........",
                "Unless… Hmm, when I think about it, that <i>is</i> a very strange thing to say… especially with prohibition.",
                "Let’s hope you were joking, because the law is always watching you, bartender."
            ]
        },
        "correctChoice": 1
    },
    {
        "lines": {
            "greet": [
                "KORGIS POLICE! PUT YOUR HANDS ON THE TABLE!",
                "Here again? Do you want to explain to me why people keep pointing to this bar?",
                "Maybe you have something to hide… even if I don’t see anything illegal here… AGAIN. Anyway, I have to continue my job.",
                "Please warn me in case you see someone serving alcohol. This'll be a nice way in which a true Korgis citizen can help the law."
            ],
            "choices": [
                "You can be sure of that, sir.",
                "He who does the spy is not a son of Mary."
            ],
            "correct": [
                "That’s a diligent citizen, respecful of the law (<i>me</i>) and the authorities.",
                "See you around.",
                "Well, actually, I hope not."
            ],
            "wrong": [
                "I know that saying. It's Italian, isn't it? I bet you're <i>one of them</i>…",
                "Damn those Italians, it's alwyas mafia, pizza, pasta, mandolino… all involved in nasty business.",
                "Let's hope you're just saying that, otherwise I'll have to cuff you next time."
            ]
        },
        "correctChoice": 0
    }
]
