{
  "Log": [
    {
      "Item1": "Inspector",
      "Item2": "Bartender! Hope I won't see anyone drunk here! The prohibition laws have just passed, and thankfully, might I add!"
    },
    {
      "Item1": "Inspector",
      "Item2": "You know, alcohol is a poison, and I'm glad that the government has finally realized that."
    },
    {
      "Item1": "Inspector",
      "Item2": "Before you ask, I'm Howard, but you can call me law. I'm the law. And I will have my revenge on the alcohol industry."
    },
    {
      "Item1": "Inspector",
      "Item2": "You will remember my name, bartender."
    },
    {
      "Item1": "Inspector",
      "Item2": "I'm Howard."
    },
    {
      "Item1": "Inspector",
      "Item2": "Yeah."
    },
    {
      "Item1": "Inspector",
      "Item2": "The law of this city."
    },
    {
      "Item1": "Doris",
      "Item2": "Good evening and good to see you, bartender. Just heard the news about the prohibition laws. I'm glad you're still open, I was worried for you."
    },
    {
      "Item1": "Doris",
      "Item2": "May I ask you for a <b>Ripple</b>, even if it's a bit risky?"
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Ripple</i>"
    },
    {
      "Item1": "Doris",
      "Item2": "A perfect Ripple, indeed. I'm impressed that you have the courage to stay open. Take care of yourself."
    },
    {
      "Item1": "Doris",
      "Item2": "May I ask you for another one for my husband, Eugene? He's waiting for me at the table."
    },
    {
      "Item1": "Eugene",
      "Item2": "HEEEEELLO BARTENDER! Oh honey, why the long face?"
    },
    {
      "Item1": "Eugene",
      "Item2": "WHAAAAT? Prohibition laws? Oh, I see. Well, I'm glad you're still open."
    },
    {
      "Item1": "Eugene",
      "Item2": "So can I really get a <b>Ripple</b> here? If it's not too much trouble, of course. In that case… I can just… pass."
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Ripple</i>"
    },
    {
      "Item1": "Eugene",
      "Item2": "THIS IS A RIPPLE! <size=75%><i>Oh, I mean, this is a Ripple.</i><size=100%>"
    },
    {
      "Item1": "Eugene",
      "Item2": "See you soon for another cup of water, you know what I mean? <size=75%><i>*wink wink*</i><size=100%>"
    },
    {
      "Item1": "Luke",
      "Item2": "Hi… I was walking by and noticed this bar was still open despite everything. You're doing the good thing, nobody is actually in favor of prohibition."
    },
    {
      "Item1": "Luke",
      "Item2": "Though, I expected to find my good friend Ernest behind the counter, hah! Maybe he retired…?"
    },
    {
      "Item1": "Luke",
      "Item2": "Anyway… I'm a bit nervous tonight, so I need that bit of booze… Can you make me a <b>Palmera</b>?"
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Palmera</i>"
    },
    {
      "Item1": "Luke",
      "Item2": "Perfect! <size=75%>Okay Luke… You can do it… Just walk up to her and, uh… <size=100%> Oh! Uh, I gotta go! Here's a tip for you, thanks again and bye!"
    },
    {
      "Item1": "Gaston",
      "Item2": "<i>Bonsoir</i>, barman. This establishment was recommended to me by a trusted client."
    },
    {
      "Item1": "Gaston",
      "Item2": "You may want to consider investing in alcohol stocks by the way… Prices have been increasing lately with the prohibition law. It's still not illegal to consume it, however."
    },
    {
      "Item1": "Gaston",
      "Item2": "Now, I would like to try out a <b>Magazine</b>, <i>s'il vous plaît</i>."
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Magazine</i>"
    },
    {
      "Item1": "Gaston",
      "Item2": "A discrete Ferrucci in this Magazine. I see we have similar tastes in wine."
    },
    {
      "Item1": "Gaston",
      "Item2": "Here, a small <i>souvenir</i> from my business. It will get me some publicity if you hang it in your bar.<br>Anyway, <i>bonne nuit</i>, barman."
    },
    {
      "Item1": "Inspector",
      "Item2": "Bartendeeerrrr, I know what your doing, hands up!"
    },
    {
      "Item1": "Inspector",
      "Item2": "Oh... this seems like a normal bar tho... no alcohol to be seen. Damn those kids, they have pranked me again, they will learn to respect me, the law."
    },
    {
      "Item1": "Inspector",
      "Item2": "Ya know, they always use this popular way of saying nowadays it was similar to <i>I have to see a man...</i>"
    },
    {
      "Item1": "Inspector",
      "Item2": "mmmmmh..."
    },
    {
      "Item1": "Inspector",
      "Item2": "Weird that you know it bartender, this is not that common at all..."
    },
    {
      "Item1": "Inspector",
      "Item2": "Aren’t you serving alcohol here dont’ you?"
    },
    {
      "Item1": "Inspector",
      "Item2": "You better not... I'm keeping an eye on you"
    },
    {
      "Item1": "Willie",
      "Item2": "Well hello hello there! Hope you've read the latest edition of Rogue, it's got some hefty tips on how to dress stylishly!"
    },
    {
      "Item1": "Willie",
      "Item2": "In any case, I shouldn't squander too much time before my next competition. Honey, make me a <b>Ripple</b>!"
    },
    {
      "Item1": "Willie",
      "Item2": "But with Verlan instead of Caledon, I like the bitterness of it. Oh, and no Gryte… Just add some more Verlan to it."
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Spring Bee</i>"
    },
    {
      "Item1": "Willie",
      "Item2": "Oh my, oh my! Just how I love it. If I didn't know any better I'd think you were trying to make an impression on me!<br>Well, I'll definitely be coming back then! See you!"
    },
    {
      "Item1": "Charles",
      "Item2": "Good to see you again there. It seems like this place is picking up the pace with the customers, even though you're new in the neighborhood."
    },
    {
      "Item1": "Charles",
      "Item2": "One <b>Parti</b> for me, please. And <i>shaken, not stirred</i>, if it's not too much to ask."
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Parti</i>"
    },
    {
      "Item1": "Charles",
      "Item2": "A fantastic drink, no doubt. It's nice to come here after work and find this welcoming atmosphere.<br>Oh, I'm overstaying my welcome. Have a good night."
    },
    {
      "Item1": "Betty",
      "Item2": "Well, hello again. I didn't notice it before but that plant over there is very pretty. It would fit well in my house.<br><size=75%>…or is it part of the wallpaper? I can't tell.<size=100%>"
    },
    {
      "Item1": "Betty",
      "Item2": "An <b>Everest</b> for me now! I don't have all day."
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Everest</i>"
    },
    {
      "Item1": "Betty",
      "Item2": "The quality has improved from the last time I was here! But I'll have you know you still have a long way to go.<br>Bye bye!"
    },
    {
      "Item1": "Inspector",
      "Item2": "Good morning bartender, how are you doing here in this nasty place of a bar?"
    },
    {
      "Item1": "Inspector",
      "Item2": "Oh, I was already here today, that's suspicious... but I didn't find anything here before."
    },
    {
      "Item1": "Inspector",
      "Item2": "Ugh, those kids again, they don't understand how bad it is to talk about alcohol like that, in this free way, they don't know what it did to my mother... <size=75%><i>*crickets*</i><size=100%>"
    },
    {
      "Item1": "Inspector",
      "Item2": "Ehm ehm... anyway, what do you think about it?"
    },
    {
      "Item1": "Inspector",
      "Item2": "That's a very strange thing to say, don't you realise you're standing in front of a police inspector?"
    },
    {
      "Item1": "Inspector",
      "Item2": "And you say that to me after what I've told you about my mother!"
    },
    {
      "Item1": "Inspector",
      "Item2": "Next time you make a stance like that, I'll put you in jail, so keep an eye out, bartender."
    },
    {
      "Item1": "Margaret",
      "Item2": "Oh, wonderful to see you again, dear bartender! My day was so busy that I almost forgot to come here."
    },
    {
      "Item1": "Margaret",
      "Item2": "But it improved when I found out <i>Eliza Davids</i> will attend the ball tonight, right here in Korgis. If only I could attend too…"
    },
    {
      "Item1": "Margaret",
      "Item2": "May I get a <b>Palmera</b>, please? I've heard bars are still selling alcohol despite the law…"
    },
    {
      "Item1": "Bartender",
      "Item2": "<i>Serves a Palmera</i>"
    },
    {
      "Item1": "Margaret",
      "Item2": "Perfect cocktail, dear bartender. I'd like to order another one, but I don't wish to overstay my welcome here… Maybe I'll visit another bar…<br>Goodnight!"
    }
  ],
  "Choices": {
    "MargaretDrunk": false,
    "MafiaDeal": false,
    "PayoffAccepted": false
  },
  "BarName": "The Chitchat",
  "DailyTime": 270.0,
  "CurrentDay": 3,
  "DrunkCustomers": 1,
  "MaxDrunkCustomers": 3,
  "Posters": [],
  "Trinkets": [
    1
  ],
  "Savings": 73.0,
  "TodayEarnings": 0.0,
  "Rent": 10,
  "Food": 10,
  "Supplies": 20,
  "currentDateTime": "2025-01-12T16:15:16.494122+01:00"
}